Table of Contents
 Interface IBimApiImporter
Namespace
IdeaStatiCa.BimApiLink.Importers
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IBimApiImporter
Methods
 Get(IIdentifier)
IIdeaObject Get(IIdentifier identifier)
Parameters
identifier IIdentifier
Returns
IIdeaObject
 Get<T>(Identifier<T>)
T Get<T>(Identifier<T> identifier) where T : IIdeaObject
Parameters
identifier Identifier<T>
Returns
T
Type Parameters
T
 Edit this page